'use strict'
// Оставить уникальные элементы массива
// важность: 4
// Пусть arr – массив строк.
// Напишите функцию unique(arr), которая возвращает массив, содержащий только уникальные элементы arr.
// Например:

function unique(arr) {
    for (let i = 0; i <= arr.length-1; i++)
    {
        for (let a = 1; a <= arr.length-1; a++)
        {
            if (arr[i] === arr[i+a])
            {
                arr.splice((i+a), 1);
                a--;
            }
        }
    }
    return arr
}
let strings = ["харе", "кришна", "кришна", "харе", "харе",
    "харе", "харе", "кришна", "кришна", "кришна", "харе", "харе", "кришна", ":-O"
];
console.log(unique(strings) ); // кришна, харе, :-O